:PROPERTIES:
:ID:       9b98bccc-85c7-4678-b1d7-1dcff1459e6b
:END:
#+title: Generate all Permutations
#+filetags: :CS:

#+begin_src python :results output
def permute(nums):
    n = len(nums)
    ans = []

    def backtrack(i):
        if i == n - 1:
            ans.append(nums.copy())
            return
        
        for j in range(i, n):
            nums[i], nums[j] = nums[j], nums[i]
            backtrack(i + 1)
            nums[i], nums[j] = nums[j], nums[i]

    backtrack(0)
    return ans

if __name__ == "__main__":
    nums = [1, 2, 3]
    print(permute(nums))
#+end_src

#+RESULTS:
: [[1, 2, 3], [1, 3, 2], [2, 1, 3], [2, 3, 1], [3, 2, 1], [3, 1, 2]]
